gitpan/zxid/c/saml2-enc.c
char* zx_ENC_WO_sp_AuthnQuery(struct zx_sp_AuthnQuery_s* x, char* p )
{
  ERR("*** enc_wo not implemented %d", 0);
  return 0;
}

/* FUNC(zx_EASY_ENC_SO_sp_AuthnQuery) */

struct zx_str_s* zx_EASY_ENC_SO_sp_AuthnQuery(struct zx_ctx* c, struct zx_sp_AuthnQuery_s* x )
{
  int len = zx_LEN_sp_AuthnQuery(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zx_ENC_SO_sp_AuthnQuery(x, buf ), buf, len);
}

/* FUNC(zx_EASY_ENC_WO_sp_AuthnQuery) */

struct zx_str_s* zx_EASY_ENC_WO_sp_AuthnQuery(struct zx_ctx* c, struct zx_sp_AuthnQuery_s* x )
{
  int len = zx_LEN_sp_AuthnQuery(x );
  char* buf = ZX_ALLOC(c, len+1);
  return zx_easy_enc_common(c, zx_ENC_WO_sp_AuthnQuery(x, buf ), buf, len);
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   sp_AuthnRequest
#define EL_STRUCT zx_sp_AuthnRequest_s
#define EL_NS     sp
#define EL_TAG    AuthnRequest

/* FUNC(zx_LEN_sp_AuthnRequest) */

/* Compute length of an element (and its subelements). The XML attributes
 * and elements are processed in schema order, although this should
 * not really matter as length in wire order should be the same. */

int zx_LEN_sp_AuthnRequest(struct zx_sp_AuthnRequest_s* x )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  int len = 1 + sizeof("AuthnRequest") - 1 + 1 + 2 + sizeof("AuthnRequest") - 1 + 1;
  
  if (x->gg.g.ns && x->gg.g.ns->prefix_len)
    len += (x->gg.g.ns->prefix_len + 1) * 2;
#else
  /* root node has no begin tag */
  int len = 0;
#endif
  
  /* *** deal with xmlns specifications in exc c14n way */

  len += zx_attr_len(x->ID, sizeof("ID"));
  len += zx_attr_len(x->Version, sizeof("Version"));
  len += zx_attr_len(x->IssueInstant, sizeof("IssueInstant"));
  len += zx_attr_len(x->Destination, sizeof("Destination"));
  len += zx_attr_len(x->Consent, sizeof("Consent"));
  len += zx_attr_len(x->ForceAuthn, sizeof("ForceAuthn"));
  len += zx_attr_len(x->IsPassive, sizeof("IsPassive"));
  len += zx_attr_len(x->ProtocolBinding, sizeof("ProtocolBinding"));
  len += zx_attr_len(x->AssertionConsumerServiceIndex, sizeof("AssertionConsumerServiceIndex"));
  len += zx_attr_len(x->AssertionConsumerServiceURL, sizeof("AssertionConsumerServiceURL"));
  len += zx_attr_len(x->AttributeConsumingServiceIndex, sizeof("AttributeConsumingServiceIndex"));
  len += zx_attr_len(x->ProviderName, sizeof("ProviderName"));

  {
      struct zx_sa_Issuer_s* e;
      for (e = x->Issuer; e; e = (struct zx_sa_Issuer_s*)e->gg.g.n)
	  len += zx_LEN_sa_Issuer(e);
  }
  {
      struct zx_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zx_ds_Signature_s*)e->gg.g.n)
	  len += zx_LEN_ds_Signature(e);
  }
  {
      struct zx_sp_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zx_sp_Extensions_s*)e->gg.g.n)
	  len += zx_LEN_sp_Extensions(e);
  }
  {
      struct zx_sa_Subject_s* e;
      for (e = x->Subject; e; e = (struct zx_sa_Subject_s*)e->gg.g.n)
	  len += zx_LEN_sa_Subject(e);
  }
  {
      struct zx_sp_NameIDPolicy_s* e;
      for (e = x->NameIDPolicy; e; e = (struct zx_sp_NameIDPolicy_s*)e->gg.g.n)
	  len += zx_LEN_sp_NameIDPolicy(e);
  }
  {
      struct zx_sa_Conditions_s* e;
      for (e = x->Conditions; e; e = (struct zx_sa_Conditions_s*)e->gg.g.n)
	  len += zx_LEN_sa_Conditions(e);
  }
  {
      struct zx_sp_RequestedAuthnContext_s* e;
      for (e = x->RequestedAuthnContext; e; e = (struct zx_sp_RequestedAuthnContext_s*)e->gg.g.n)
	  len += zx_LEN_sp_RequestedAuthnContext(e);
  }
  {
      struct zx_sp_Scoping_s* e;
      for (e = x->Scoping; e; e = (struct zx_sp_Scoping_s*)e->gg.g.n)
	  len += zx_LEN_sp_Scoping(e);
  }


  len += zx_len_common(&x->gg); 
  return len;
}

/* FUNC(zx_ENC_SO_sp_AuthnRequest) */

/* Render element into string. The XML attributes and elements are
 * processed in schema order. This is what you generally want for
 * rendering new data structure to a string. The wo pointers are not used. */

char* zx_ENC_SO_sp_AuthnRequest(struct zx_sp_AuthnRequest_s* x, char* p )
{
  struct zx_elem_s* se;
#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '<');
  if (x->gg.g.ns && x->gg.g.ns->prefix_len) {
    ZX_OUT_MEM(p, x->gg.g.ns->prefix, x->gg.g.ns->prefix_len);
    ZX_OUT_CH(p, ':');
  }
  ZX_OUT_MEM(p, "AuthnRequest", sizeof("AuthnRequest") - 1);
#else
  /* root node has no begin tag */
#endif
  /* *** deal with xmlns specifications in exc c14n way */

  p = zx_attr_enc(p, x->ID, "ID", sizeof("ID")-1);
  p = zx_attr_enc(p, x->Version, "Version", sizeof("Version")-1);
  p = zx_attr_enc(p, x->IssueInstant, "IssueInstant", sizeof("IssueInstant")-1);
  p = zx_attr_enc(p, x->Destination, "Destination", sizeof("Destination")-1);
  p = zx_attr_enc(p, x->Consent, "Consent", sizeof("Consent")-1);
  p = zx_attr_enc(p, x->ForceAuthn, "ForceAuthn", sizeof("ForceAuthn")-1);
  p = zx_attr_enc(p, x->IsPassive, "IsPassive", sizeof("IsPassive")-1);
  p = zx_attr_enc(p, x->ProtocolBinding, "ProtocolBinding", sizeof("ProtocolBinding")-1);
  p = zx_attr_enc(p, x->AssertionConsumerServiceIndex, "AssertionConsumerServiceIndex", sizeof("AssertionConsumerServiceIndex")-1);
  p = zx_attr_enc(p, x->AssertionConsumerServiceURL, "AssertionConsumerServiceURL", sizeof("AssertionConsumerServiceURL")-1);
  p = zx_attr_enc(p, x->AttributeConsumingServiceIndex, "AttributeConsumingServiceIndex", sizeof("AttributeConsumingServiceIndex")-1);
  p = zx_attr_enc(p, x->ProviderName, "ProviderName", sizeof("ProviderName")-1);


  p = zx_enc_so_unknown_attrs(p, x->gg.any_attr);

#if 1 /* NORMALMODE */
  ZX_OUT_CH(p, '>');
#else
  /* root node has no begin tag */
#endif
  
  {
      struct zx_sa_Issuer_s* e;
      for (e = x->Issuer; e; e = (struct zx_sa_Issuer_s*)e->gg.g.n)
	  p = zx_ENC_SO_sa_Issuer(e, p);
  }
  {
      struct zx_ds_Signature_s* e;
      for (e = x->Signature; e; e = (struct zx_ds_Signature_s*)e->gg.g.n)
	  p = zx_ENC_SO_ds_Signature(e, p);
  }
  {
      struct zx_sp_Extensions_s* e;
      for (e = x->Extensions; e; e = (struct zx_sp_Extensions_s*)e->gg.g.n)
	  p = zx_ENC_SO_sp_Extensions(e, p);
  }
  {
      struct zx_sa_Subject_s* e;
      for (e = x->Subject; e; e = (struct zx_sa_Subject_s*)e->gg.g.n)
	  p = zx_ENC_SO_sa_Subject(e, p);
  }
  {
      struct zx_sp_NameIDPolicy_s* e;
      for (e = x->NameIDPolicy; e; e = (struct zx_sp_NameIDPolicy_s*)e->gg.g.n)
	  p = zx_ENC_SO_sp_NameIDPolicy(e, p);
  }
  {
      struct zx_sa_Conditions_s* e;
      for (e = x->Conditions; e; e = (struct zx_sa_Conditions_s*)e->gg.g.n)
	  p = zx_ENC_SO_sa_Conditions(e, p);
  }
  {
      struct zx_sp_RequestedAuthnContext_s* e;
      for (e = x->RequestedAuthnContext; e; e = (struct zx_sp_RequestedAuthnContext_s*)e->gg.g.n)
	  p = zx_ENC_SO_sp_RequestedAuthnContext(e, p);
  }
  {
      struct zx_sp_Scoping_s* e;
      for (e = x->Scoping; e; e = (struct zx_sp_Scoping_s*)e->gg.g.n)
	  p = zx_ENC_SO_sp_Scoping(e, p);
  }


  p = zx_enc_so_unknown_elems_and_content(p, &x->gg);
  
